<?php


return [

	// +----------------------------------------------------------------------
	// | 日志设置
	// +----------------------------------------------------------------------

	'log'                    => [
		// 日志记录方式，内置 file socket 支持扩展
		'type'  => 'File',
		// 日志保存目录
		// 日志记录级别
		'level' => [],
	],

	// +----------------------------------------------------------------------
	// | 缓存设置
	// +----------------------------------------------------------------------

	'cache'                  => [
		// 驱动方式
		'type'   => 'Redis',
		// 缓存保存目录
		// 缓存前缀
		'prefix' => '',
		// 缓存有效期 0表示永久缓存
		'expire' => 0,
	],


	// +----------------------------------------------------------------------
	// | Cookie设置
	// +----------------------------------------------------------------------
	'cookie'                 => [
		// cookie 名称前缀
		'prefix'    => '',
		// cookie 保存时间
		'expire'    => 0,
		// cookie 保存路径
		'path'      => '/',
		// cookie 有效域名
		'domain'    => '',
		//  cookie 启用安全传输
		'secure'    => false,
		// httponly设置
		'httponly'  => '',
		// 是否使用 setcookie
		'setcookie' => true,
	],

	//分页配置
	'paginate'               => [
		'type'      => 'bootstrap',
		'var_page'  => 'page',
		'list_rows' => 15,
	],

	//Default Response Header
	'response' =>[
		'content-type'=>'application/json',
	]
];
